app/controllers/todo_items_controller.rb

def destroy
 @todo_item = @todo_list.todo_items.find(params[:id])
 if @todo_item.destroy
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 6], ["id", 4], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 4]]