app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at", "duedate") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", "2020-09-18 12:25:04.027691"], ["updated_at", "2020-09-18 12:25:04.027691"], ["duedate", "2020-09-08 00:00:00"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 4]]
---
  def destroy
    @todo_list.destroy

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])